src/cf/InformationRegisters/ПерваяОтчетнаяКампания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПерваяОтчетнаяКампания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодКампании</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ПерваяОтчетнаяКампания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЭтоПерваяОтчетнаяКампания(Организация, ДатаОпроса, Периодичность) Экспорт
	
	ЭтоПерваяОтчетнаяКампания = Истина;
	
	МенеджерЗаписи = РегистрыСведений.ПерваяОтчетнаяКампания.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если Периодичность = Перечисления.Периодичность.Месяц Тогда
			ДатаОкончанияКампании = КонецМесяца(МенеджерЗаписи.ПериодКампании);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
			ДатаОкончанияКампании = КонецКвартала(МенеджерЗаписи.ПериодКампании);
		Иначе
			ДатаОкончанияКампании = КонецГода(МенеджерЗаписи.ПериодКампании);
		КонецЕсли;
			
		ЭтоПерваяОтчетнаяКампания = ДатаОкончанияКампании > ДатаОпроса;
		
	Иначе
		ЗарегистрироватьПервуюОтчетнуюКампанию(Организация, ДатаОпроса);
	КонецЕсли;
	
	Возврат ЭтоПерваяОтчетнаяКампания;
	
КонецФункции

Функция ПервыйПериодКампании(Организация) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ПерваяОтчетнаяКампания.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация = Организация;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.ПериодКампании;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьПервуюОтчетнуюКампанию(Организация, ДатаКампании)
	
	МенеджерЗаписи = РегистрыСведений.ПерваяОтчетнаяКампания.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация    = Организация;
	МенеджерЗаписи.ПериодКампании = НачалоМесяца(ДатаКампании);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
